zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/clock/ch32v20x_30x-clocks.h
/*
 * Copyright (c) 2024 MASSDRIVER EI (massdriver.space)
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief CH32V20x_30x peripheral clock identifiers for devicetree bindings
 * @ingroup clock_control_ch32
 */

#ifndef __CH32V20X_V30X_CLOCKS_H__
#define __CH32V20X_V30X_CLOCKS_H__

#include "ch32-common.h"

/** @brief AHB bus register offset */
#define CH32_CLOCK_PCENR_AHB  0x14
/** @brief APB2 bus register offset */
#define CH32_CLOCK_PCENR_APB2 0x18
/** @brief APB1 bus register offset */
#define CH32_CLOCK_PCENR_APB1 0x1C

/** @cond INTERNAL_HIDDEN */

#define CH32V20X_V30X_CLOCK_DMA1     CH32_CLOCK(AHB, 0)
#define CH32V20X_V30X_CLOCK_DMA2     CH32_CLOCK(AHB, 1)
#define CH32V20X_V30X_CLOCK_SRAM     CH32_CLOCK(AHB, 2)
#define CH32V20X_V30X_CLOCK_FLITF    CH32_CLOCK(AHB, 4)
#define CH32V20X_V30X_CLOCK_CRC      CH32_CLOCK(AHB, 6)
#define CH32V20X_V30X_CLOCK_FSMC     CH32_CLOCK(AHB, 8)
#define CH32V20X_V30X_CLOCK_RNG      CH32_CLOCK(AHB, 9)
#define CH32V20X_V30X_CLOCK_SDIO     CH32_CLOCK(AHB, 10)
#define CH32V20X_V30X_CLOCK_USBHS    CH32_CLOCK(AHB, 11)
#define CH32V20X_V30X_CLOCK_OTG_FS   CH32_CLOCK(AHB, 12)
#define CH32V20X_V30X_CLOCK_DVP      CH32_CLOCK(AHB, 13)
#define CH32V20X_V30X_CLOCK_ETHMAC   CH32_CLOCK(AHB, 14)
#define CH32V20X_V30X_CLOCK_ETHMACTX CH32_CLOCK(AHB, 15)
#define CH32V20X_V30X_CLOCK_ETHMACRX CH32_CLOCK(AHB, 16)
#define CH32V20X_V30X_CLOCK_BLEC     CH32_CLOCK(AHB, 16)
#define CH32V20X_V30X_CLOCK_BLES     CH32_CLOCK(AHB, 17)

#define CH32V20X_V30X_CLOCK_AFIO   CH32_CLOCK(APB2, 0)
#define CH32V20X_V30X_CLOCK_IOPA   CH32_CLOCK(APB2, 2)
#define CH32V20X_V30X_CLOCK_IOPB   CH32_CLOCK(APB2, 3)
#define CH32V20X_V30X_CLOCK_IOPC   CH32_CLOCK(APB2, 4)
#define CH32V20X_V30X_CLOCK_IOPD   CH32_CLOCK(APB2, 5)
#define CH32V20X_V30X_CLOCK_IOPE   CH32_CLOCK(APB2, 6)
#define CH32V20X_V30X_CLOCK_ADC1   CH32_CLOCK(APB2, 9)
#define CH32V20X_V30X_CLOCK_ADC2   CH32_CLOCK(APB2, 10)
#define CH32V20X_V30X_CLOCK_TIM1   CH32_CLOCK(APB2, 11)
#define CH32V20X_V30X_CLOCK_SPI1   CH32_CLOCK(APB2, 12)
#define CH32V20X_V30X_CLOCK_TIM8   CH32_CLOCK(APB2, 13)
#define CH32V20X_V30X_CLOCK_USART1 CH32_CLOCK(APB2, 14)
#define CH32V20X_V30X_CLOCK_TIM9   CH32_CLOCK(APB2, 19)
#define CH32V20X_V30X_CLOCK_TIM10  CH32_CLOCK(APB2, 20)

#define CH32V20X_V30X_CLOCK_TIM2   CH32_CLOCK(APB1, 0)
#define CH32V20X_V30X_CLOCK_TIM3   CH32_CLOCK(APB1, 1)
#define CH32V20X_V30X_CLOCK_TIM4   CH32_CLOCK(APB1, 2)
#define CH32V20X_V30X_CLOCK_TIM5   CH32_CLOCK(APB1, 3)
#define CH32V20X_V30X_CLOCK_TIM6   CH32_CLOCK(APB1, 4)
#define CH32V20X_V30X_CLOCK_TIM7   CH32_CLOCK(APB1, 5)
#define CH32V20X_V30X_CLOCK_USART6 CH32_CLOCK(APB1, 6)
#define CH32V20X_V30X_CLOCK_USART7 CH32_CLOCK(APB1, 7)
#define CH32V20X_V30X_CLOCK_USART8 CH32_CLOCK(APB1, 8)
#define CH32V20X_V30X_CLOCK_WWDG   CH32_CLOCK(APB1, 11)
#define CH32V20X_V30X_CLOCK_SPI2   CH32_CLOCK(APB1, 14)
#define CH32V20X_V30X_CLOCK_SPI3   CH32_CLOCK(APB1, 15)
#define CH32V20X_V30X_CLOCK_USART2 CH32_CLOCK(APB1, 17)
#define CH32V20X_V30X_CLOCK_USART3 CH32_CLOCK(APB1, 18)
#define CH32V20X_V30X_CLOCK_USART4 CH32_CLOCK(APB1, 19)
#define CH32V20X_V30X_CLOCK_USART5 CH32_CLOCK(APB1, 20)
#define CH32V20X_V30X_CLOCK_I2C1   CH32_CLOCK(APB1, 21)
#define CH32V20X_V30X_CLOCK_I2C2   CH32_CLOCK(APB1, 22)
#define CH32V20X_V30X_CLOCK_USBD   CH32_CLOCK(APB1, 23)
#define CH32V20X_V30X_CLOCK_CAN1   CH32_CLOCK(APB1, 25)
#define CH32V20X_V30X_CLOCK_CAN2   CH32_CLOCK(APB1, 26)
#define CH32V20X_V30X_CLOCK_BKP    CH32_CLOCK(APB1, 27)
#define CH32V20X_V30X_CLOCK_PWR    CH32_CLOCK(APB1, 28)
#define CH32V20X_V30X_CLOCK_DAC    CH32_CLOCK(APB1, 29)

/** @endcond */

#endif
